CSI API ETABS v1
cDatabaseTables.GetTableForEditingCSVFile Method
 Returns a single table in a CSV file for interactive editing.
 Namespace: ETABSv1
 Assembly: ETABSv1 (in ETABSv1.dll) Version: 1.0.0.0 (2.6.0.0)
Syntax
int GetTableForEditingCSVFile(
	string TableKey,
	string GroupName,
	ref int TableVersion,
	string csvFilePath,
	string sepChar = ","
)
Function GetTableForEditingCSVFile (
	TableKey As String,
	GroupName As String,
	ByRef TableVersion As Integer,
	csvFilePath As String,
	Optional sepChar As String = ","
) As Integer
Dim instance As cDatabaseTables
Dim TableKey As String
Dim GroupName As String
Dim TableVersion As Integer
Dim csvFilePath As String
Dim sepChar As String
Dim returnValue As Integer
returnValue = instance.GetTableForEditingCSVFile(TableKey,
	GroupName, TableVersion, csvFilePath,
	sepChar)
int GetTableForEditingCSVFile(
	String^ TableKey,
	String^ GroupName,
	int% TableVersion,
	String^ csvFilePath,
	String^ sepChar = L","
)
abstract GetTableForEditingCSVFile :
        TableKey : string *
        GroupName : string *
        TableVersion : int byref *
        csvFilePath : string *
        ?sepChar : string
(* Defaults:
        let _sepChar = defaultArg sepChar ","
*)
-> int
Parameters
TableKey
Type: System.String
Input Item: The table key for a table which will be interactively edited. The table must be one that can be interactively edited.
GroupName
Type: System.String
 Input Item: IMPORTANT NOTE: This parameter is not active in this release.
 The name of a group for which data will be returned.
TableVersion
Type: System.Int32
Returned Item: The version number of the specified table.
csvFilePath
Type: System.String
Input Item: The fully-qualified path for the CSV file containing the table data. Only the importable fields are included in the table.
sepChar (Optional)
Type: System.String
Optional Input Item: The delimiter between data items, by default ","
Return Value
Type: Int32
Returns 0 if the function executes correctly, otherwise returns nonzero
See Also
Reference
cDatabaseTables Interface
ETABSv1 Namespace